group1 = [
    "Иванов",
    "Петров",
    "Сидоров",
    "Козлов",
    "Николаев",
    "Смирнов",
    "Кузнецов",
    "Васильев",
    "Попов",
    "Соколов",
]
group2 = [
    "Морозов",
    "Волков",
    "Козлов",
    "Иванов",
    "Попов",
    "Соколов",
    "Лебедев",
    "Кравчук",
    "Макаров",
    "Павлов",
]

sports = tuple(group1[:5] + group2[:5])
print(
    f"Группа 1:{group1}\nГруппа 2:{group2}\nСпортивная команда: {sports}\nДлина кортежа: {len(sports)}"
)
sorted = sorted(sports)
print("Отсортированная спортивная команда:", sorted)
ivanov = sorted.count("Иванов")
print("Фамилия 'Иванов' встречается", ivanov, "раз в кортеже.")
